HandHeldLegend/HOJA-LIB-RP2040/src/drivers/bluetooth/esp32_hojabaseband.c
#include "board_config.h"

#if defined(HOJA_TRANSPORT_BT_DRIVER) && (HOJA_TRANSPORT_BT_DRIVER==BT_DRIVER_ESP32HOJA)
#include "drivers/bluetooth/esp32_hojabaseband.h"

#include "transport/transport.h"

#include <string.h>
#include <stddef.h>

#include "hoja.h"

#include "hal/gpio_hal.h"
#include "hal/sys_hal.h"
#include "hal/i2c_hal.h"

#include "devices_shared_types.h"
#include "devices/battery.h"
#include "devices/fuelgauge.h"

#include "utilities/interval.h"
#include "utilities/settings.h"

#include "transport/transport_bt.h"

#include "ns_lib_haptics.h"
#include "sinput_lib.h"

#include "input/mapper.h"
#include "input/imu.h"

#define ESP32_CLAMP(val, min, max) ((val) < (min) ? (min) : ((val) > (max) ? (max) : (val)))

#if defined(HOJA_USB_MUX_DRIVER) && (HOJA_USB_MUX_DRIVER==USB_MUX_DRIVER_PI3USB4000A)
    #include "drivers/mux/pi3usb4000a.h"
#elif defined(HOJA_TRANSPORT_BT_DRIVER) && (HOJA_TRANSPORT_BT_DRIVER==BT_DRIVER_ESP32HOJA)
    #error "HOJA_USB_MUX_DRIVER must be defined for the ESP32 bluetooth driver" 
#endif


    #include "drivers/bluetooth/esp32_hojabaseband.h"

// Size of messages we send OUT
#define HOJA_I2C_MSG_SIZE_OUT 32
#define I2C_START_CMD_CRC_LEN 13

// The size of messages coming from the ESP32
#define HOJA_I2C_MSG_SIZE_IN 24
#define BT_CONNECTION_TIMEOUT_POWER_SECONDS (30)
#define BT_FLASH_BRIGHTNESS 20

#define BT_HOJABB_I2CINPUT_ADDRESS 0x76

core_params_s *_bt_esp32_params = NULL;

typedef struct
{
    uint8_t mode;
    uint8_t mac[6];
} i2cinput_init_s;

typedef enum 
{
    POWER_CODE_OFF = 0, 
    POWER_CODE_RESET = 1,
    POWER_CODE_CRITICAL = 2,
} i2c_power_code_t;

// Status return data types
typedef enum
{
    I2C_STATUS_NULL, // Nothing to report
    I2C_STATUS_HAPTIC_STANDARD, // Standard haptic data
    I2C_STATUS_HAPTIC_SWITCH, // Nintendo Switch haptic data
    I2C_STATUS_FIRMWARE_VERSION, // Report fw version
    I2C_STATUS_CONNECTED_STATUS, // Connected status change
    I2C_STATUS_POWER_CODE, // Change power setting
    I2C_STATUS_MAC_UPDATE, // Update HOST save MAC address
    I2C_STATUS_HAPTIC_SINPUT, // SINPUT haptics
} i2cinput_status_t;

typedef enum
{
    I2C_CMD_STANDARD = 0xFF, // Regular input data
    I2C_CMD_MOTION = 0xFC, // Motion data
    I2C_CMD_START = 0xFE, // Launch BT Mode with parameter
    I2C_CMD_FIRMWARE_VERSION = 0xFD, // Retrieve the firmware version
} i2cinput_cmd_t;

typedef struct
{
    uint8_t cmd;
    uint16_t rand_seed; // Random data to help our CRC
    uint8_t data[19]; // Buffer for related data   
} __attribute__ ((packed)) i2cinput_status_s;

// 22 bytes
#define I2CINPUT_STATUS_SIZE sizeof(i2cinput_status_s)

typedef enum
{
    BT_CONNSTAT_NULL = -1,
    BT_CONNSTAT_DISCONNECTED = 0
} bt_connstat_t;

uint8_t data_out[HOJA_I2C_MSG_SIZE_OUT] = {0};
uint8_t data_in[HOJA_I2C_MSG_SIZE_IN] = {0};

static bt_connstat_t _current_connected = -1;
static uint8_t _current_i2c_packet_number = 0;
bluetooth_cb_t _bluetooth_cb = NULL;

typedef struct
{
    union
    {
        struct
        {
            // D-Pad
            uint8_t dpad_up     : 1;
            uint8_t dpad_down   : 1;
            uint8_t dpad_left   : 1;
            uint8_t dpad_right  : 1;
            // Buttons
            uint8_t button_south : 1; // Switch B
            uint8_t button_east : 1; // Switch A
            uint8_t button_west : 1; // Switch Y
            uint8_t button_north : 1; // Switch X

            // Triggers
            uint8_t trigger_l   : 1;
            uint8_t trigger_zl  : 1;
            uint8_t trigger_r   : 1;
            uint8_t trigger_zr  : 1;

            // Special Functions
            uint8_t button_plus     : 1;
            uint8_t button_minus    : 1;

            // Stick clicks
            uint8_t button_stick_left   : 1;
            uint8_t button_stick_right  : 1;
        };
        uint16_t buttons_all;
    };

    union
    {
        struct
        {
            // Menu buttons (Not remappable by API)
            uint8_t button_capture  : 1;
            uint8_t button_home     : 1;
            uint8_t button_safemode : 1;
            uint8_t button_shipping : 1;
            uint8_t button_sync     : 1;
            uint8_t button_unbind   : 1;
            uint8_t trigger_gl      : 1;
            uint8_t trigger_gr      : 1;
        };
        uint8_t buttons_system;
    };

    uint16_t lx;
    uint16_t ly;
    uint16_t rx;
    uint16_t ry;
    uint16_t lt;
    uint16_t rt;

    int16_t ax;
    int16_t ay;
    int16_t az;
    int16_t gx;
    int16_t gy;
    int16_t gz;

    uint8_t power_stat;
} __attribute__ ((packed)) i2cinput_input_s;

#define I2CINPUT_INPUT_SIZE sizeof(i2cinput_input_s)

// Polynomial for CRC-8 (x^8 + x^2 + x + 1)
#define CRC8_POLYNOMIAL 0x07

uint8_t _crc8_compute(uint8_t *data, size_t length)
{
    uint8_t crc = 0x00; // Initial value of CRC
    for (size_t i = 0; i < length; i++)
    {
        crc ^= data[i]; // XOR the next byte into the CRC

        for (uint8_t j = 0; j < 8; j++)
        {
            if (crc & 0x80)
            { // If the MSB is set
                crc = (crc << 1) ^ CRC8_POLYNOMIAL;
            }
            else
            {
                crc <<= 1;
            }
        }
    }

    if (!crc)
        crc++; // Must be non-zero

    return crc;
}

bool _crc8_verify(uint8_t *data, size_t length, uint8_t received_crc)
{
    uint8_t calculated_crc = _crc8_compute(data, length);
    return calculated_crc == received_crc;
}

void _bt_clear_out()
{
    memset(data_out, 0, HOJA_I2C_MSG_SIZE_OUT);
}

void _bt_clear_in()
{
    memset(data_in, 0, HOJA_I2C_MSG_SIZE_IN);
}

void _esp32hoja_enable_chip(bool enabled)
{
    if(enabled)
    {
        gpio_hal_init(BLUETOOTH_DRIVER_ENABLE_PIN, false, true);
        gpio_hal_write(BLUETOOTH_DRIVER_ENABLE_PIN, true);
    }
    else
    {
        gpio_hal_init(BLUETOOTH_DRIVER_ENABLE_PIN, false, false);
        gpio_hal_write(BLUETOOTH_DRIVER_ENABLE_PIN, false);
    }

    if(enabled)
        // Give time for the chip to boot
        sys_hal_sleep_ms(1000);
}

void _esp32hoja_enable_uart(bool enabled)
{
    HOJA_USB_MUX_ENABLE(false);
    sys_hal_sleep_ms(100);
    if(enabled)
    {
        HOJA_USB_MUX_SELECT(1);
    }
    else
    {
        HOJA_USB_MUX_SELECT(0);
    }
    sys_hal_sleep_ms(100);
    HOJA_USB_MUX_ENABLE(true);
}

const uint32_t connection_attempt_ms = 25 * 1000;
uint32_t connection_attempts = 0;

void _btinput_message_parse(uint8_t *data)
{
    // Handle auto-shut-off timer
    if(_current_connected < 1)
    {
        connection_attempts++;
        if(connection_attempts >= connection_attempt_ms)
        {
            connection_attempts = 0;
            // Shut down
        }
    }

    uint8_t crc = data[0];
    uint8_t counter = data[1];
    bool packet_updated = false;
    i2cinput_status_s status = {0};

    bluetooth_cb_msg_s btcb_msg = {0};

