HandHeldLegend/HOJA-LIB-RP2040/src/drivers/bluetooth/esp32_hojabaseband.c
    const uint8_t attempts_reset = 25;
    static uint8_t attempts_remaining = attempts_reset;

    // Verify CRC before proceeding (only if it's present)
    if (crc > 0)
    {
        bool verified = false;
        verified = _crc8_verify((uint8_t *)&(data[2]), sizeof(i2cinput_status_s), crc);

        if (!verified)
        {
            return;
        }

        memcpy(&status, &(data[2]), sizeof(i2cinput_status_s));
            
        if(_current_i2c_packet_number != counter)
        {
            packet_updated = true;
            _current_i2c_packet_number = counter;
        }
    }   

    // Only process fresh data
    if(!packet_updated)
    {
        return;
    }

    switch (status.cmd)
    {
    default:
        break;

    // No data to report
    case I2C_STATUS_NULL:
    {
    }
    break;

    case I2C_STATUS_CONNECTED_STATUS:
    {
        // Handle connected status
        if (_current_connected != status.data[0])
        {
            _current_connected = (int8_t) status.data[0];
            if (_current_connected > 0)
            {
                tp_evt_s evt_conn = {.evt = TP_EVT_CONNECTIONCHANGE, .evt_connectionchange = {.connection = TP_CONNECTION_CONNECTED}};
                transport_evt_cb(evt_conn);

                tp_evt_s player_conn = {.evt = TP_EVT_PLAYERLED, .evt_playernumber = {.player_number = _current_connected}};
                transport_evt_cb(player_conn);
            }
            else
            {
                // Disconnected
                tp_evt_s evt_conn = {.evt = TP_EVT_CONNECTIONCHANGE, .evt_connectionchange = {.connection = TP_CONNECTION_DISCONNECTED}};
                transport_evt_cb(evt_conn);
            }
        }
    }
    break;

    case I2C_STATUS_POWER_CODE:
    {
        uint8_t power_code = status.data[0];

        btcb_msg.type = BTCB_POWER_CODE;

        if (power_code == POWER_CODE_OFF)
        {
            tp_evt_s shutdown_evt = {.evt = TP_EVT_POWERCOMMAND, .evt_powercommand = {.power_command = TP_POWERCOMMAND_SHUTDOWN}};
            transport_evt_cb(shutdown_evt);
        }
        else if (power_code == POWER_CODE_RESET)
        {
            tp_evt_s reboot_evt = {.evt = TP_EVT_POWERCOMMAND, .evt_powercommand = {.power_command = TP_POWERCOMMAND_REBOOT}};
            transport_evt_cb(reboot_evt);
        }
        else if(power_code == POWER_CODE_CRITICAL)
        {
            tp_evt_s crit_evt = {.evt = TP_EVT_POWERCOMMAND, .evt_powercommand = {.power_command = TP_POWERCOMMAND_LOWPOWER}};
            transport_evt_cb(crit_evt);
        }
    }
    break;

    case I2C_STATUS_HAPTIC_SWITCH:
    {
        // ESP32 forwards the 4-byte Switch HD-rumble word; NS-LIB decodes it and
        // dispatches through ns_api_hook_set_haptic_packet_raw -> haptics_set_ns_hd.
        ns_haptics_rumble_translate(&(status.data[0]));
    }
    break;

    case I2C_STATUS_HAPTIC_STANDARD:
    {
        uint8_t l = status.data[0];
        uint8_t r = status.data[1];
        
        tp_evt_s rumble = {
            .evt = TP_EVT_ERMRUMBLE,
            .evt_ermrumble = {
            .left=l, .right=r,
            .leftbrake=!l?true:false, .rightbrake=!r?true:false
        }};

        transport_evt_cb(rumble);
    }
    break;

    case I2C_STATUS_HAPTIC_SINPUT:
    {
        // ESP32 forwards the SInput haptic payload (type byte + stereo data).
        // Wrap it in a minimal output report so sinput_api_output_tunnel routes
        // to sinput_api_hook_set_haptics / set_rumble.
        uint8_t out_report[19];
        out_report[0] = SINPUT_OUTPUT_ID_CMDDAT;
        out_report[1] = 0x01; // SINPUT_COMMAND_HAPTIC
        memcpy(&out_report[2], status.data, sizeof(out_report) - 2);
        sinput_api_output_tunnel(out_report, sizeof(out_report));
    }
    break;
    }

}

// Init firmware loading mode
void esp32hoja_init_load() 
{
    #if defined(HOJA_USB_MUX_INIT)
    HOJA_USB_MUX_INIT();
    #endif

    _esp32hoja_enable_uart(true);
    sys_hal_sleep_ms(200);
    _esp32hoja_enable_chip(true);
}

bool esp32hoja_init(int device_mode, bool pairing_mode, bluetooth_cb_t evt_cb)
{
    
}

void esp32hoja_stop()
{
    _esp32hoja_enable_uart(false);
    _esp32hoja_enable_chip(false);
}

void esp32hoja_task(uint64_t timestamp)
{
    
}

int esp32hoja_hwtest()
{

}

uint32_t esp32hoja_get_fwversion()
{
    
}

void transport_bt_stop()
{

}

// ESP32 baseband always expects live gyro/accel in the standard input packet.
// There is no separate I2C motion-enable command — turn IMU reads on here.
static void _esp32_bt_enable_imu(void)
{
    if (imu_driver_channel_count() == 0)
        return;

    imu_config->imu_disabled = 0;
    imu_set_read_mode(IMU_MODE_STANDARD);
}

bool transport_bt_init(core_params_s *params)
{
    _bt_esp32_params = params;

    if (!_bt_esp32_params)
        return false;

    #if defined(HOJA_USB_MUX_INIT)
    HOJA_USB_MUX_INIT();
    #endif

    uint8_t esp32_legacy_mode = 0;

    if(params->core_boot_flags & COREBOOT_FLAG_ALTFLASH)
    {
        esp32hoja_init_load();
        return true;
    }

    // ESP32 baseband wire protocol uses the same mode indices as core_reportformat_t.
    switch (params->core_report_format)
    {
        case CORE_REPORTFORMAT_SWPRO:
        case CORE_REPORTFORMAT_SINPUT:
        esp32_legacy_mode = (uint8_t)params->core_report_format;
        break;

        default:
        return false;
    }

    uint8_t pair_flag = ((params->core_boot_flags & COREBOOT_FLAG_PAIR) ? 0b10000000 : 0);
    uint8_t out_mode = pair_flag | esp32_legacy_mode;

    #if defined(HOJA_BT_LOGGING_DEBUG) && (HOJA_BT_LOGGING_DEBUG==1)
    _esp32hoja_enable_uart(true);
    #endif

    _esp32hoja_enable_chip(true);

    #if defined(HOJA_BT_LOGGING_DEBUG) && (HOJA_BT_LOGGING_DEBUG==1)
    sys_hal_sleep_ms(5000);
    #endif

    _bt_clear_out();

    data_out[0] = I2C_CMD_START;
    data_out[2] = out_mode;

    #if defined(BLUETOOTH_DRIVER_BATMON_ENABLE) && (BLUETOOTH_DRIVER_BATMON_ENABLE==1)
        #if !defined(BLUETOOTH_DRIVER_BATMON_ADC_GPIO)
        #error "BLUETOOTH_DRIVER_BATMON_ADC_GPIO must be defined if BLUETOOTH_DRIVER_BATMON_ENABLE==1"
        #else
        // Enable battery monitoring unless we positively know there is no pack.
        if (battery_pack_state() != BATTERY_PACK_ABSENT)
        {
            data_out[3] = true;
            data_out[4] = BLUETOOTH_DRIVER_BATMON_ADC_GPIO;
        }
        else
        {
            data_out[3] = false;
            data_out[4] = 0;
        }
        #endif
    #else 
        data_out[3] = false;
        data_out[4] = 0;
    #endif

    // RGB Data
    #define GET_RED(val) ((val & 0xFF0000) >> 16)
    #define GET_GREEN(val) ((val & 0xFF00) >> 8)
    #define GET_BLUE(val) ((val & 0xFF))
    uint32_t col;

    col = gamepad_config->gamepad_color_grip_left;
    data_out[5] = GET_RED(col);
    data_out[6] = GET_GREEN(col);
    data_out[7] = GET_BLUE(col);

    col = gamepad_config->gamepad_color_grip_right;
    data_out[8] = GET_RED(col);
    data_out[9] = GET_GREEN(col);
    data_out[10] = GET_BLUE(col);

    col = gamepad_config->gamepad_color_body;
    data_out[11] = GET_RED(col);
    data_out[12] = GET_GREEN(col);
    data_out[13] = GET_BLUE(col);

    col = gamepad_config->gamepad_color_buttons;
    data_out[14] = GET_RED(col);
    data_out[15] = GET_GREEN(col);
    data_out[16] = GET_BLUE(col);

    // New VID/PID section for SInput mode. Pulled from the hoja config, with
    // library fallbacks (Raspberry Pi VID / Hoja PID) when the board leaves 0.
    const hoja_config_s *dev_cfg = hoja_config_get();
    uint16_t vid = (dev_cfg && dev_cfg->usb_vid) ? dev_cfg->usb_vid : 0x2E8A;
    uint16_t pid = (dev_cfg && dev_cfg->usb_pid) ? dev_cfg->usb_pid : 0x10C6;

    data_out[17] = (vid >> 8);
    data_out[18] = (vid & 0xFF);

    data_out[19] = (pid >> 8);
    data_out[20] = (pid & 0xFF);
    // end VID/PID section

    // Stupid workaround for SuperGamepad+ :)
    data_out[21] = dev_cfg ? dev_cfg->sinput.gamepad_subtype : 0;

    // Local MAC
    memcpy(&data_out[22], _bt_esp32_params->transport_dev_mac, 6);

    // Calculate CRC
    uint8_t crc = _crc8_compute(&(data_out[2]), I2C_START_CMD_CRC_LEN);
    data_out[1] = crc;

    int stat = i2c_hal_write_timeout_us(BLUETOOTH_DRIVER_I2C_INSTANCE, BT_HOJABB_I2CINPUT_ADDRESS, data_out, HOJA_I2C_MSG_SIZE_OUT, false, 150000);

    if (stat < 0)
    {
        return false;
    }

    _esp32_bt_enable_imu();
    return true;
}

