HandHeldLegend/HOJA-LIB-RP2040/src/drivers/bluetooth/esp32_hojabaseband.c
void transport_bt_task(uint64_t timestamp)
{
    static interval_s       interval    = {0};
    static i2cinput_input_s input_data  = {0};

    if(!_bt_esp32_params) return;

    if (_bt_esp32_params->core_boot_flags & COREBOOT_FLAG_ALTFLASH)
        return;

    static bool read_write = true;

    if(interval_run(timestamp, 650, &interval))
    {
        memset(data_out, 0x80, 24); // Reset buffer to 0x80 for blank

        if(read_write)
        {
            mapper_input_s input = mapper_get_input();

            data_out[0] = I2C_CMD_STANDARD;
            data_out[1] = 0;                  // Input CRC location
            data_out[2] = _current_i2c_packet_number; // Response packet number counter

            input_data.buttons_all      = 0;//buttons.buttons_all;
            input_data.buttons_system   = 0;//buttons.buttons_system;

            switch(_bt_esp32_params->core_report_format)
            {
                default:
                case CORE_REPORTFORMAT_SWPRO:
                int lx = mapper_joystick_concat(2048, input.inputs[SWITCH_CODE_LX_LEFT], input.inputs[SWITCH_CODE_LX_RIGHT]); 
                int ly = mapper_joystick_concat(2048, input.inputs[SWITCH_CODE_LY_DOWN], input.inputs[SWITCH_CODE_LY_UP]);   
                int rx = mapper_joystick_concat(2048, input.inputs[SWITCH_CODE_RX_LEFT], input.inputs[SWITCH_CODE_RX_RIGHT]); 
                int ry = mapper_joystick_concat(2048, input.inputs[SWITCH_CODE_RY_DOWN], input.inputs[SWITCH_CODE_RY_UP]);   

                // Clamp values between 0 and 4095
                input_data.lx = (uint16_t) ESP32_CLAMP(lx, 0, 4095);
                input_data.ly = (uint16_t) ESP32_CLAMP(ly, 0, 4095);
                input_data.rx = (uint16_t) ESP32_CLAMP(rx, 0, 4095);
                input_data.ry = (uint16_t) ESP32_CLAMP(ry, 0, 4095);

                input_data.button_south = input.presses[SWITCH_CODE_B];
                input_data.button_east  = input.presses[SWITCH_CODE_A];
                input_data.button_west  = input.presses[SWITCH_CODE_Y];
                input_data.button_north = input.presses[SWITCH_CODE_X];

                bool dpad[4] = {input.presses[SWITCH_CODE_DOWN], input.presses[SWITCH_CODE_RIGHT],
                    input.presses[SWITCH_CODE_LEFT], input.presses[SWITCH_CODE_UP]};

                dpad_translate_input(dpad);

                input_data.dpad_down     = dpad[0];
                input_data.dpad_right    = dpad[1];
                input_data.dpad_left     = dpad[2];
                input_data.dpad_up       = dpad[3];

                input_data.button_minus    = input.presses[SWITCH_CODE_MINUS];
                input_data.button_plus     = input.presses[SWITCH_CODE_PLUS];
                input_data.button_home     = input.presses[SWITCH_CODE_HOME];
                input_data.button_capture  = input.presses[SWITCH_CODE_CAPTURE];

                input_data.button_stick_left   = input.presses[SWITCH_CODE_LS];
                input_data.button_stick_right    = input.presses[SWITCH_CODE_RS];

                input_data.trigger_r = input.presses[SWITCH_CODE_R];
                input_data.trigger_l = input.presses[SWITCH_CODE_L];
                
                input_data.trigger_zl = input.presses[SWITCH_CODE_ZL];
                input_data.trigger_zr = input.presses[SWITCH_CODE_ZR];

                input_data.lt = 0;
                input_data.rt = 0;
                break;

                case CORE_REPORTFORMAT_SINPUT:
                int slx = mapper_joystick_concat(2048, input.inputs[SINPUT_CODE_LX_LEFT], input.inputs[SINPUT_CODE_LX_RIGHT]);
                int sly = mapper_joystick_concat(2048, input.inputs[SINPUT_CODE_LY_DOWN], input.inputs[SINPUT_CODE_LY_UP]);   
                int srx = mapper_joystick_concat(2048, input.inputs[SINPUT_CODE_RX_LEFT], input.inputs[SINPUT_CODE_RX_RIGHT]);
                int sry = mapper_joystick_concat(2048, input.inputs[SINPUT_CODE_RY_DOWN], input.inputs[SINPUT_CODE_RY_UP]);   

                // Clamp values between 0 and 4095
                input_data.lx = (uint16_t) ESP32_CLAMP(slx, 0, 4095);
                input_data.ly = (uint16_t) ESP32_CLAMP(sly, 0, 4095);
                input_data.rx = (uint16_t) ESP32_CLAMP(srx, 0, 4095);
                input_data.ry = (uint16_t) ESP32_CLAMP(sry, 0, 4095);

                input_data.button_south = input.presses[SINPUT_CODE_SOUTH];
                input_data.button_east  = input.presses[SINPUT_CODE_EAST];
                input_data.button_west  = input.presses[SINPUT_CODE_WEST];
                input_data.button_north = input.presses[SINPUT_CODE_NORTH];

                bool sdpad[4] = {input.presses[SINPUT_CODE_DOWN], input.presses[SINPUT_CODE_RIGHT],
                    input.presses[SINPUT_CODE_LEFT], input.presses[SINPUT_CODE_UP]};

                dpad_translate_input(sdpad);

                input_data.dpad_down     = sdpad[0];
                input_data.dpad_right    = sdpad[1];
                input_data.dpad_left     = sdpad[2];
                input_data.dpad_up       = sdpad[3];

                input_data.button_minus    = input.presses[SINPUT_CODE_SELECT];
                input_data.button_plus     = input.presses[SINPUT_CODE_START];
                input_data.button_home     = input.presses[SINPUT_CODE_GUIDE];
                input_data.button_capture  = input.presses[SINPUT_CODE_SHARE];

                input_data.button_stick_left   = input.presses[SINPUT_CODE_LS];
                input_data.button_stick_right  = input.presses[SINPUT_CODE_RS];

                input_data.trigger_r = input.presses[SINPUT_CODE_RB];
                input_data.trigger_l = input.presses[SINPUT_CODE_LB];

                input_data.trigger_zl = input.presses[SINPUT_CODE_LT];
                input_data.trigger_zr = input.presses[SINPUT_CODE_RT];

                input_data.lt = ESP32_CLAMP(input.inputs[SINPUT_CODE_LT_ANALOG], 0, 4095);
                input_data.rt = ESP32_CLAMP(input.inputs[SINPUT_CODE_RT_ANALOG], 0, 4095);

