HandHeldLegend/HOJA-LIB-RP2040/src/drivers/bluetooth/esp32_hojabaseband.c
                input_data.button_shipping = input.presses[SINPUT_CODE_MISC_3];
                break;
            }

            static imu_data_s imu = {0};
            imu_access_safe(&imu);

            input_data.gx = imu.gx;
            input_data.gy = imu.gy;
            input_data.gz = imu.gz;
            input_data.ax = imu.ax;
            input_data.ay = imu.ay;
            input_data.az = imu.az;

            // Power status
            {
                static battery_status_s bstat = {0};
                static fuelgauge_status_s fstat = {0};

                battery_get_status(&bstat);
                fuelgauge_get_status(&fstat);

                esp32_battery_status_u s = {
                    .bat_lvl    = 4,
                    .charging   = 0,
                    .connection = 0
                };

                if(bstat.connected)
                {
                    if(bstat.charging)
                    {
                        s.charging = 1;
                    }
                    else s.charging = 0;
                }

                if(fstat.connected)
                {
                    switch(fstat.simple)
                    {
                        case BATTERY_LEVEL_CRITICAL:
                        s.bat_lvl = 1;
                        break;

                        case BATTERY_LEVEL_LOW:
                        s.bat_lvl = 1;
                        break;

                        case BATTERY_LEVEL_MID:
                        s.bat_lvl = 2;
                        break;

                        case BATTERY_LEVEL_HIGH:
                        s.bat_lvl = 4;
                        break;
                    }
                }

                input_data.power_stat = s.val;
            }

            uint8_t crc = _crc8_compute((uint8_t *)&input_data, sizeof(i2cinput_input_s)-1); // Subtract 1 for size because of legacy compatibility for baseband
            data_out[1] = crc;

            memcpy(&(data_out[3]), &input_data, sizeof(i2cinput_input_s));

            int write = i2c_hal_write_timeout_us_odbaud(BLUETOOTH_DRIVER_I2C_INSTANCE, BT_HOJABB_I2CINPUT_ADDRESS, data_out, HOJA_I2C_MSG_SIZE_OUT, false, 32000, 800);
            if (write == HOJA_I2C_MSG_SIZE_OUT)
            {
                _bt_clear_out();
            }

        }  
        else
        {
            int read = i2c_hal_read_timeout_us_odbaud(BLUETOOTH_DRIVER_I2C_INSTANCE, BT_HOJABB_I2CINPUT_ADDRESS, data_in, HOJA_I2C_MSG_SIZE_IN, false, 32000, 800);
            
            if (read == HOJA_I2C_MSG_SIZE_IN)
            {
                _btinput_message_parse(data_in);
                _bt_clear_in();
            }
        }
        read_write = !read_write;
    }
}

#define BTINPUT_GET_VERSION_ATTEMPTS 10

static uint16_t _esp32_static_cached_version = 0;

static uint32_t _esp32_bt_probe_version(void)
{
    uint32_t ret_info = 0x00;

    uint8_t attempts = BTINPUT_GET_VERSION_ATTEMPTS;

    _esp32hoja_enable_chip(true);

    static uint8_t data_in[HOJA_I2C_MSG_SIZE_IN] = {0};

    while (attempts--)
    {
        _bt_clear_out();
        data_out[0] = I2C_CMD_FIRMWARE_VERSION;

        int stat = i2c_hal_write_timeout_us(BLUETOOTH_DRIVER_I2C_INSTANCE, BT_HOJABB_I2CINPUT_ADDRESS, data_out, HOJA_I2C_MSG_SIZE_OUT, false, 10000);
        (void)stat;
        sys_hal_sleep_ms(4);
        int read = i2c_hal_read_timeout_us(BLUETOOTH_DRIVER_I2C_INSTANCE, BT_HOJABB_I2CINPUT_ADDRESS, data_in, HOJA_I2C_MSG_SIZE_IN, false, 10000);

        if (read == HOJA_I2C_MSG_SIZE_IN)
        {
            uint16_t version = (uint16_t)((data_in[1] << 8) | data_in[2]);
            ret_info = version;

            _esp32hoja_enable_chip(false);
            return ret_info;
        }
    }

    _esp32hoja_enable_chip(false);
    return 0x00;
}

void transport_bt_static_get_caps(transport_bt_static_caps_s *caps)
{
    if (caps == NULL)
    {
        return;
    }

    caps->bdr_supported = 1;
    caps->ble_supported = 0;
    caps->external_update_supported = 1;
}

uint8_t transport_bt_static_part_status(void)
{
    uint32_t version = _esp32_bt_probe_version();
    _esp32_static_cached_version = (uint16_t)version;
    return version > 0u ? TRANSPORT_WIRELESS_PART_OK : TRANSPORT_WIRELESS_PART_ERROR;
}

uint16_t transport_bt_static_external_version(void)
{
    return _esp32_static_cached_version;
}

const char *bluetooth_driver_part_code(void)
{
    return "ESP32";
}

// -------------------------------------------------------------------------
// Optional ESP32 fuel gauge driver
//
// When a board uses the ESP32 baseband for bluetooth it may *optionally* route
// fuel-gauge duties to the ESP32 module instead of a dedicated gauge IC, by
// selecting HOJA_FUELGAUGE_DRIVER == FUELGAUGE_DRIVER_ESP32. The strong
// fuelgauge_driver_* overrides below are then compiled in (the gate also shapes
// hoja_config_s so no `.fuelgauge` config member is required for this driver).
// -------------------------------------------------------------------------

#if defined(HOJA_FUELGAUGE_DRIVER) && (HOJA_FUELGAUGE_DRIVER == FUELGAUGE_DRIVER_ESP32)

static uint8_t _esp32_fuelgauge_percent   = 100;
static bool    _esp32_fuelgauge_connected = true;

void esp32hoja_fuelgauge_report(uint8_t percent, bool connected)
{
    _esp32_fuelgauge_percent   = (percent > 100) ? 100 : percent;
    _esp32_fuelgauge_connected = connected;
}

bool fuelgauge_driver_init(uint16_t capacity_mah)
{
    (void)capacity_mah;
    return true;
}

fuelgauge_status_s fuelgauge_driver_get_status(void)
{
    fuelgauge_status_s status = {0};
    status.connected = _esp32_fuelgauge_connected;
    status.percent   = _esp32_fuelgauge_percent;
    return status;
}

const char *fuelgauge_driver_part_code(void)
{
    return "ESP32";
}

#endif // HOJA_FUELGAUGE_DRIVER == FUELGAUGE_DRIVER_ESP32

#endif